Revit 2026 API

# DirectShapeTypeOptionsIsValid Method

---

Determines whether a DirectShapeTypeOptions is internally consistent (valid).

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValid()
```
```vb
Public Function IsValid As Boolean
```
```cpp
public:
bool IsValid()
```
```fsharp
member IsValid : unit -> bool
```

#### Return Value

Boolean

This is currently a placeholder and always returns true. Will be made public_api and a validator when it does something useful.

#### Reference

DirectShapeTypeOptions Class

Autodesk.Revit.DB Namespace